scripts/output/1_get_empty_wrk.txt
Running 1m test @ http://localhost:8080
  4 threads and 4 connections
  Thread calibration: mean lat.: 4.672ms, rate sampling interval: 21ms
  Thread calibration: mean lat.: 4.046ms, rate sampling interval: 20ms
  Thread calibration: mean lat.: 2.280ms, rate sampling interval: 10ms
  Thread calibration: mean lat.: 4.643ms, rate sampling interval: 21ms
  Thread Stats   Avg      Stdev     Max   +/- Stdev
    Latency     4.04ms    5.51ms  95.74ms   89.63%
    Req/Sec     2.62k   834.36     8.33k    75.98%
  Latency Distribution (HdrHistogram - Recorded Latency)
 50.000%    1.99ms
 75.000%    5.03ms
 90.000%    9.75ms
 99.000%   25.14ms
 99.900%   58.01ms
 99.990%   88.89ms
 99.999%   94.46ms
100.000%   95.81ms

  Detailed Percentile spectrum:
       Value   Percentile   TotalCount 1/(1-Percentile)

       0.054     0.000000            1         1.00
       0.551     0.100000        50098         1.11
       0.919     0.200000       100112         1.25
       1.176     0.300000       150050         1.43
       1.553     0.400000       200127         1.67
       1.992     0.500000       250035         2.00
       2.405     0.550000       275047         2.22
       2.897     0.600000       300075         2.50
       3.469     0.650000       325026         2.86
       4.167     0.700000       350058         3.33
       5.027     0.750000       375087         4.00
       5.535     0.775000       387538         4.44
       6.115     0.800000       400032         5.00
       6.787     0.825000       412486         5.71
       7.583     0.850000       424992         6.67
       8.543     0.875000       437542         8.00
       9.103     0.887500       443774         8.89
       9.751     0.900000       450016        10.00
      10.495     0.912500       456258        11.43
      11.359     0.925000       462494        13.33
      12.399     0.937500       468766        16.00
      12.975     0.943750       471858        17.78
      13.655     0.950000       475008        20.00
      14.439     0.956250       478132        22.86
      15.319     0.962500       481252        26.67
      16.447     0.968750       484357        32.00
      17.135     0.971875       485921        35.56
      17.919     0.975000       487493        40.00
      18.879     0.978125       489050        45.71
      20.015     0.981250       490616        53.33
      21.423     0.984375       492173        64.00
      22.255     0.985938       492953        71.11
      23.247     0.987500       493744        80.00
      24.351     0.989062       494514        91.43
      25.759     0.990625       495296       106.67
      27.631     0.992188       496077       128.00
      28.847     0.992969       496467       142.22
      30.463     0.993750       496858       160.00
      32.015     0.994531       497250       182.86
      33.887     0.995313       497642       213.33
      36.799     0.996094       498031       256.00
      38.623     0.996484       498225       284.44
      39.935     0.996875       498419       320.00
      40.895     0.997266       498621       365.71
      42.559     0.997656       498813       426.67
      45.695     0.998047       499008       512.00
      47.583     0.998242       499104       568.89
      50.335     0.998437       499200       640.00
      52.767     0.998633       499298       731.43
      55.935     0.998828       499396       853.33
      58.271     0.999023       499493      1024.00
      59.519     0.999121       499543      1137.78
      60.607     0.999219       499592      1280.00
      61.887     0.999316       499640      1462.86
      63.135     0.999414       499689      1706.67
      65.183     0.999512       499737      2048.00
      68.159     0.999561       499762      2275.56
      72.575     0.999609       499787      2560.00
      75.391     0.999658       499811      2925.71
      77.055     0.999707       499835      3413.33
      81.791     0.999756       499859      4096.00
      84.735     0.999780       499872      4551.11
      85.823     0.999805       499885      5120.00
      86.847     0.999829       499896      5851.43
      87.551     0.999854       499909      6826.67
      88.255     0.999878       499920      8192.00
      88.639     0.999890       499928      9102.22
      88.959     0.999902       499933     10240.00
      89.279     0.999915       499939     11702.86
      89.599     0.999927       499945     13653.33
      89.919     0.999939       499951     16384.00
      90.303     0.999945       499955     18204.44
      90.495     0.999951       499957     20480.00
      90.751     0.999957       499960     23405.71
      91.071     0.999963       499963     27306.67
      91.967     0.999969       499966     32768.00
      92.607     0.999973       499968     36408.89
      92.927     0.999976       499969     40960.00
      93.311     0.999979       499971     46811.43
      93.631     0.999982       499973     54613.33
      93.887     0.999985       499974     65536.00
      94.207     0.999986       499975     72817.78
      94.207     0.999988       499975     81920.00
      94.463     0.999989       499976     93622.86
      94.719     0.999991       499977    109226.67
      95.039     0.999992       499978    131072.00
      95.039     0.999993       499978    145635.56
      95.039     0.999994       499978    163840.00
      95.359     0.999995       499979    187245.71
      95.359     0.999995       499979    218453.33
      95.615     0.999996       499980    262144.00
      95.615     0.999997       499980    291271.11
      95.615     0.999997       499980    327680.00
      95.615     0.999997       499980    374491.43
      95.615     0.999998       499980    436906.67
      95.807     0.999998       499981    524288.00
      95.807     1.000000       499981          inf
#[Mean    =        4.043, StdDeviation   =        5.508]
#[Max     =       95.744, Total count    =       499981]
#[Buckets =           27, SubBuckets     =         2048]
----------------------------------------------------------
  599971 requests in 1.00m, 40.16MB read
  Non-2xx or 3xx responses: 399984
Requests/sec:   9998.64
Transfer/sec:    685.38KB