scripts/output/1_get_empty_wrk.txt
Running 20s test @ http://localhost:8080
  4 threads and 4 connections
  Thread calibration: mean lat.: 104.690ms, rate sampling interval: 1011ms
  Thread calibration: mean lat.: 4.040ms, rate sampling interval: 21ms
  Thread calibration: mean lat.: 4.189ms, rate sampling interval: 22ms
  Thread calibration: mean lat.: 77.457ms, rate sampling interval: 646ms
  Thread Stats   Avg      Stdev     Max   +/- Stdev
    Latency     4.43ms    4.91ms  37.44ms   85.34%
    Req/Sec     2.60k     0.89k    5.76k    70.19%
  Latency Distribution (HdrHistogram - Recorded Latency)
 50.000%    2.43ms
 75.000%    5.80ms
 90.000%   11.90ms
 99.000%   21.02ms
 99.900%   29.28ms
 99.990%   35.65ms
 99.999%   37.18ms
100.000%   37.47ms

  Detailed Percentile spectrum:
       Value   Percentile   TotalCount 1/(1-Percentile)

       0.057     0.000000            2         1.00
       0.597     0.100000        10011         1.11
       0.974     0.200000        20018         1.25
       1.308     0.300000        29987         1.43
       1.747     0.400000        40003         1.67
       2.431     0.500000        49991         2.00
       2.867     0.550000        54972         2.22
       3.363     0.600000        59981         2.50
       3.993     0.650000        64976         2.86
       4.799     0.700000        69974         3.33
       5.803     0.750000        74965         4.00
       6.443     0.775000        77467         4.44
       7.179     0.800000        79961         5.00
       8.067     0.825000        82458         5.71
       9.183     0.850000        84971         6.67
      10.471     0.875000        87454         8.00
      11.151     0.887500        88716         8.89
      11.895     0.900000        89958        10.00
      12.679     0.912500        91207        11.43
      13.511     0.925000        92454        13.33
      14.463     0.937500        93701        16.00
      14.999     0.943750        94331        17.78
      15.543     0.950000        94952        20.00
      16.119     0.956250        95576        22.86
      16.719     0.962500        96199        26.67
      17.407     0.968750        96824        32.00
      17.791     0.971875        97138        35.56
      18.191     0.975000        97453        40.00
      18.655     0.978125        97769        45.71
      19.135     0.981250        98078        53.33
      19.695     0.984375        98396        64.00
      19.983     0.985938        98547        71.11
      20.303     0.987500        98702        80.00
      20.735     0.989062        98854        91.43
      21.199     0.990625        99010       106.67
      21.727     0.992188        99167       128.00
      22.015     0.992969        99248       142.22
      22.335     0.993750        99327       160.00
      22.767     0.994531        99401       182.86
      23.391     0.995313        99479       213.33
      23.999     0.996094        99557       256.00
      24.367     0.996484        99596       284.44
      24.943     0.996875        99636       320.00
      25.631     0.997266        99674       365.71
      26.335     0.997656        99713       426.67
      26.991     0.998047        99754       512.00
      27.311     0.998242        99773       568.89
      27.647     0.998437        99791       640.00
      28.143     0.998633        99811       731.43
      28.607     0.998828        99830       853.33
      29.471     0.999023        99850      1024.00
      30.031     0.999121        99860      1137.78
      30.575     0.999219        99869      1280.00
      31.135     0.999316        99879      1462.86
      31.839     0.999414        99889      1706.67
      32.399     0.999512        99899      2048.00
      32.719     0.999561        99904      2275.56
      32.927     0.999609        99908      2560.00
      33.183     0.999658        99913      2925.71
      33.567     0.999707        99918      3413.33
      33.919     0.999756        99923      4096.00
      34.239     0.999780        99926      4551.11
      34.495     0.999805        99929      5120.00
      34.591     0.999829        99930      5851.43
      35.071     0.999854        99933      6826.67
      35.359     0.999878        99935      8192.00
      35.647     0.999890        99937      9102.22
      35.711     0.999902        99938     10240.00
      35.967     0.999915        99939     11702.86
      36.031     0.999927        99940     13653.33
      36.223     0.999939        99941     16384.00
      36.319     0.999945        99942     18204.44
      36.511     0.999951        99943     20480.00
      36.511     0.999957        99943     23405.71
      36.607     0.999963        99944     27306.67
      36.607     0.999969        99944     32768.00
      36.895     0.999973        99945     36408.89
      36.895     0.999976        99945     40960.00
      36.895     0.999979        99945     46811.43
      37.183     0.999982        99946     54613.33
      37.183     0.999985        99946     65536.00
      37.183     0.999986        99946     72817.78
      37.183     0.999988        99946     81920.00
      37.183     0.999989        99946     93622.86
      37.471     0.999991        99947    109226.67
      37.471     1.000000        99947          inf
#[Mean    =        4.425, StdDeviation   =        4.913]
#[Max     =       37.440, Total count    =        99947]
#[Buckets =           27, SubBuckets     =         2048]
----------------------------------------------------------
  199976 requests in 20.01s, 13.16MB read
  Non-2xx or 3xx responses: 199976
Requests/sec:   9995.34
Transfer/sec:    673.51KB